clear all 
clc 
fs=2000;fsr=4000;
Ts=1/fs;N=5000;t1=0.2;
h=1/fsr;   
t=0:Ts:(N-1)*Ts;
% A=0.2;
D=0.2;  
%a1=1.3007;b1=0.5162;c1=0.0418;d1=0.2208;m=0.1002;r1=0.6028;
%  a2=1.5827;b2=0.4108;c2=0.0418;d2=0.2208;e2=0.1001;m=0.1002;r=0.6328;
% a=1.3518;b=0.3562;c=0.1418;d=0.2208;e=0.1001;f=0.3519;m=0.1002;r=0.6328;
% a=0.5518;b=0.4129;c=0.0618;d=0.3208;r=0.1128;
a1=0.3033;b1=0.55;v=2.87905;r1=0.2094;c1=1.594628;e=0.090661;
%s2=0.2*cos(2*pi*11.5*t).*((0<t)&(t<1)); 
%s2=0.25.*exp(-100.*(t-(t./t1).*t1)).*sin(1200*pi*(t-(t./t1).*t1)).*((0<=t)&(t<t1))+0.27.*exp(-100.*(t-(t./t1).*t1)).*sin(1200*pi*(t-(t./t1).*t1)).*((t1<=t)&(t<2*t1))+0.2.*exp(-100.*(t-(t./t1).*t1)).*sin(1200*pi*(t-(t./t1).*t1)).*((2*t1<=t)&(t<3*t1))+0.3.*exp(-100.*(t-(t./t1).*t1)).*sin(1200*pi*(t-(t./t1).*t1)).*((3*t1<=t)&(t<4*t1))+0.2.*exp(-100.*(t-(t./t1).*t1)).*sin(1200*pi*(t-(t./t1).*t1)).*((4*t1<=t)&(t<5*t1))+0.25.*exp(-100.*(t-(t./t1).*t1)).*sin(1200*pi*(t-(t./t1).*t1)).*((5*t1<=t)&(t<6*t1))+0.29.*exp(-100.*(t-(t./t1).*t1)).*sin(1200*pi*(t-(t./t1).*t1)).*((6*t1<=t)&(t<7*t1))+0.31.*exp(-100.*(t-(t./t1).*t1)).*sin(1200*pi*(t-(t./t1).*t1)).*((7*t1<=t)&(t<8*t1));
%s2=0.25.*exp(-100.*(t)).*sin(1000*pi*(t)).*((0<=t)&(t<t1))+0.27.*exp(-100.*(t-t1)).*sin(1000*pi*(t-t1)).*((t1<=t)&(t<2*t1))+0.2.*exp(-100.*(t-2*t1)).*sin(1000*pi*(t-2*t1)).*((2*t1<=t)&(t<3*t1))+0.3.*exp(-100.*(t-3*t1)).*sin(1000*pi*(t-3*t1)).*((3*t1<=t)&(t<4*t1))+0.2.*exp(-100.*(t-4*t1)).*sin(1000*pi*(t-4*t1)).*((4*t1<=t)&(t<5*t1))+0.25.*exp(-100.*(t-5*t1)).*sin(1000*pi*(t-5*t1)).*((5*t1<=t)&(t<6*t1))+0.29.*exp(-100.*(t-6*t1)).*sin(1000*pi*(t-6*t1)).*((6*t1<=t)&(t<7*t1))+0.31.*exp(-100.*(t-7*t1)).*sin(1000*pi*(t-7*t1)).*((7*t1<=t)&(t<8*t1));
s2=0.25.*exp(-100.*(t)).*sin(1000*pi*(t)).*((0<=t)&(t<t1))+0.25.*exp(-100.*(t-t1)).*sin(1000*pi*(t-t1)).*((t1<=t)&(t<2*t1))+0.25.*exp(-100.*(t-2*t1)).*sin(1000*pi*(t-2*t1)).*((2*t1<=t)&(t<3*t1))+0.25.*exp(-100.*(t-3*t1)).*sin(1000*pi*(t-3*t1)).*((3*t1<=t)&(t<4*t1))+0.25.*exp(-100.*(t-4*t1)).*sin(1000*pi*(t-4*t1)).*((4*t1<=t)&(t<5*t1))+0.25.*exp(-100.*(t-5*t1)).*sin(1000*pi*(t-5*t1)).*((5*t1<=t)&(t<6*t1))+0.25.*exp(-100.*(t-6*t1)).*sin(1000*pi*(t-6*t1)).*((6*t1<=t)&(t<7*t1))+0.25.*exp(-100.*(t-7*t1)).*sin(1000*pi*(t-7*t1)).*((7*t1<=t)&(t<8*t1));
%s2=ht.*exp(-100.*(t-(t./t1).*t1)).*sin(1200*pi*(t-(t./t1).*t1));
noise=sqrt(2*D)*randn(size(t));
%输入信号波形  
x11=s2+noise;

 figure(1)
 subplot(2,1,1) 
 plot(t,s2,'k')
 xlim([0,1.5]);
 xlabel('(a) t/s');
 ylabel('幅度');
 y00=fft(s2);  
 p0=y00.*conj(y00)/N;%功率谱大小
 ff=fs*(0:N/2-2)/(N);
 p10=10*p0(1:N/2-1);
 subplot(2,1,2)
 plot(ff,p10,'k');
 
 figure(2)
 subplot(2,1,1) 
 plot(t,x11,'k')
  xlim([0,0.4]);
 xlabel('(a) t/s');
 ylabel('幅度');
 y0=fft(x11);  
 p=y0.*conj(y0)/N;%功率谱大小
 ff=fs*(0:N/2-2)/N;
 p1=p(1:N/2-1);
 subplot(2,1,2)
 plot(ff,p1,'k');
 
 x=TDUPQSRlgkt(a1,b1,v,r1,c1,e,h,x11);
%  x=lgkt1(a1,b1,c1,d1,m,r1,h,x11);
%  z=olgkt(a,b,c,d,r,h,x11);
% % zz=lgkt3(a,b,c,d,e,f,m,r,h,x11);
% 
 figure(3)
subplot(2,1,1)
plot(t,x,'k')
 xlim([0,1.5]);
xlabel('(c) t/s');
 y1=fft(x);  
  pp=y1.*conj(y1)/N;%功率谱大小
  ff=fs*(0:N/2-2)/(N);
  p2=pp(1:N/2-1);
  subplot(2,1,2)
 plot(ff,p2,'k'); 
% % 
%   figure(4)
% subplot(2,2,1)
% plot(t,z,'k')
%  xlim([0,0.4]);
% xlabel('(c) t/s');
%  y2=fft(z);  
%   ppp=y2.*conj(y2)/N;%功率谱大小
%   ff=fs*(0:N/2-2)/N;
%   p3=ppp(1:N/2-1);
%   subplot(2,2,2)
%  plot(ff,p3,'k'); 
% %  
% %  figure(4)
% % subplot(1,2,1)
% % plot(t,zz,'k')
% % xlim([0,500]);
% % xlabel('(c) t/s');
% % y3=fft(zz);  
% % pppp=y3.*conj(y3)/N;%功率谱大小
% % ff=fs*(0:N/2-2)/N;
% % p4=pppp(1:N/2-1);
% % subplot(1,2,2);
% %  plot(ff,p4,'k'); 
% 
% ff0=find(ff==11.5);
% SNRin = 10*log10(p1(ff0)/(sum(p1)-p1(ff0)))
% SNRout1 =10*log10( p2(ff0)/(sum(p2)-p2(ff0)))
% SNRout2 =10*log10( p3(ff0)/(sum(p3)-p3(ff0)))  